XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/iso11898_reg.h
/**
  ******************************************************************************
  * @file    iso11898_reg.h
  * @version V1.0
  * @date    2020-12-29
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __ISO11898_REG_H__
#define __ISO11898_REG_H__

#include "bl606p.h"

/* 0x0 : op mode:rw        reset mode:rw */
#define ISO11898_MODE_OFFSET            (0x0)
#define ISO11898_RESET_REQUEST          ISO11898_RESET_REQUEST
#define ISO11898_RESET_REQUEST_POS      (0U)
#define ISO11898_RESET_REQUEST_LEN      (1U)
#define ISO11898_RESET_REQUEST_MSK      (((1U << ISO11898_RESET_REQUEST_LEN) - 1) << ISO11898_RESET_REQUEST_POS)
#define ISO11898_RESET_REQUEST_UMSK     (~(((1U << ISO11898_RESET_REQUEST_LEN) - 1) << ISO11898_RESET_REQUEST_POS))
#define ISO11898_LISTEN_ONLY            ISO11898_LISTEN_ONLY
#define ISO11898_LISTEN_ONLY_POS        (1U)
#define ISO11898_LISTEN_ONLY_LEN        (1U)
#define ISO11898_LISTEN_ONLY_MSK        (((1U << ISO11898_LISTEN_ONLY_LEN) - 1) << ISO11898_LISTEN_ONLY_POS)
#define ISO11898_LISTEN_ONLY_UMSK       (~(((1U << ISO11898_LISTEN_ONLY_LEN) - 1) << ISO11898_LISTEN_ONLY_POS))
#define ISO11898_SELT_TEST              ISO11898_SELT_TEST
#define ISO11898_SELT_TEST_POS          (2U)
#define ISO11898_SELT_TEST_LEN          (1U)
#define ISO11898_SELT_TEST_MSK          (((1U << ISO11898_SELT_TEST_LEN) - 1) << ISO11898_SELT_TEST_POS)
#define ISO11898_SELT_TEST_UMSK         (~(((1U << ISO11898_SELT_TEST_LEN) - 1) << ISO11898_SELT_TEST_POS))
#define ISO11898_ACCEPTANCE_FILTER      ISO11898_ACCEPTANCE_FILTER
#define ISO11898_ACCEPTANCE_FILTER_POS  (3U)
#define ISO11898_ACCEPTANCE_FILTER_LEN  (1U)
#define ISO11898_ACCEPTANCE_FILTER_MSK  (((1U << ISO11898_ACCEPTANCE_FILTER_LEN) - 1) << ISO11898_ACCEPTANCE_FILTER_POS)
#define ISO11898_ACCEPTANCE_FILTER_UMSK (~(((1U << ISO11898_ACCEPTANCE_FILTER_LEN) - 1) << ISO11898_ACCEPTANCE_FILTER_POS))

/* 0x4 : op mode:w        r  ->  8'h00
reset mode:w    r   -> 8'h00 */
#define ISO11898_COMMAND_OFFSET              (0x4)
#define ISO11898_TRANSMIT_REQUEST            ISO11898_TRANSMIT_REQUEST
#define ISO11898_TRANSMIT_REQUEST_POS        (0U)
#define ISO11898_TRANSMIT_REQUEST_LEN        (1U)
#define ISO11898_TRANSMIT_REQUEST_MSK        (((1U << ISO11898_TRANSMIT_REQUEST_LEN) - 1) << ISO11898_TRANSMIT_REQUEST_POS)
#define ISO11898_TRANSMIT_REQUEST_UMSK       (~(((1U << ISO11898_TRANSMIT_REQUEST_LEN) - 1) << ISO11898_TRANSMIT_REQUEST_POS))
#define ISO11898_ABORT_TRANSMISSION          ISO11898_ABORT_TRANSMISSION
#define ISO11898_ABORT_TRANSMISSION_POS      (1U)
#define ISO11898_ABORT_TRANSMISSION_LEN      (1U)
#define ISO11898_ABORT_TRANSMISSION_MSK      (((1U << ISO11898_ABORT_TRANSMISSION_LEN) - 1) << ISO11898_ABORT_TRANSMISSION_POS)
#define ISO11898_ABORT_TRANSMISSION_UMSK     (~(((1U << ISO11898_ABORT_TRANSMISSION_LEN) - 1) << ISO11898_ABORT_TRANSMISSION_POS))
#define ISO11898_RELEASE_RECEIVE_BUFFER      ISO11898_RELEASE_RECEIVE_BUFFER
#define ISO11898_RELEASE_RECEIVE_BUFFER_POS  (2U)
#define ISO11898_RELEASE_RECEIVE_BUFFER_LEN  (1U)
#define ISO11898_RELEASE_RECEIVE_BUFFER_MSK  (((1U << ISO11898_RELEASE_RECEIVE_BUFFER_LEN) - 1) << ISO11898_RELEASE_RECEIVE_BUFFER_POS)
#define ISO11898_RELEASE_RECEIVE_BUFFER_UMSK (~(((1U << ISO11898_RELEASE_RECEIVE_BUFFER_LEN) - 1) << ISO11898_RELEASE_RECEIVE_BUFFER_POS))
#define ISO11898_CLEAR_DATA_OVERRUN          ISO11898_CLEAR_DATA_OVERRUN
#define ISO11898_CLEAR_DATA_OVERRUN_POS      (3U)
#define ISO11898_CLEAR_DATA_OVERRUN_LEN      (1U)
#define ISO11898_CLEAR_DATA_OVERRUN_MSK      (((1U << ISO11898_CLEAR_DATA_OVERRUN_LEN) - 1) << ISO11898_CLEAR_DATA_OVERRUN_POS)
#define ISO11898_CLEAR_DATA_OVERRUN_UMSK     (~(((1U << ISO11898_CLEAR_DATA_OVERRUN_LEN) - 1) << ISO11898_CLEAR_DATA_OVERRUN_POS))
#define ISO11898_SELF_REQUEST                ISO11898_SELF_REQUEST
#define ISO11898_SELF_REQUEST_POS            (4U)
#define ISO11898_SELF_REQUEST_LEN            (1U)
#define ISO11898_SELF_REQUEST_MSK            (((1U << ISO11898_SELF_REQUEST_LEN) - 1) << ISO11898_SELF_REQUEST_POS)
#define ISO11898_SELF_REQUEST_UMSK           (~(((1U << ISO11898_SELF_REQUEST_LEN) - 1) << ISO11898_SELF_REQUEST_POS))

/* 0x8 : op mode:r       reset mode:r */
#define ISO11898_STATUS_OFFSET              (0x8)
#define ISO11898_RECEIVE_BUFFER_STS         ISO11898_RECEIVE_BUFFER_STS
#define ISO11898_RECEIVE_BUFFER_STS_POS     (0U)
#define ISO11898_RECEIVE_BUFFER_STS_LEN     (1U)
#define ISO11898_RECEIVE_BUFFER_STS_MSK     (((1U << ISO11898_RECEIVE_BUFFER_STS_LEN) - 1) << ISO11898_RECEIVE_BUFFER_STS_POS)
#define ISO11898_RECEIVE_BUFFER_STS_UMSK    (~(((1U << ISO11898_RECEIVE_BUFFER_STS_LEN) - 1) << ISO11898_RECEIVE_BUFFER_STS_POS))
#define ISO11898_DATA_OVERRUN_STS           ISO11898_DATA_OVERRUN_STS
#define ISO11898_DATA_OVERRUN_STS_POS       (1U)
#define ISO11898_DATA_OVERRUN_STS_LEN       (1U)
#define ISO11898_DATA_OVERRUN_STS_MSK       (((1U << ISO11898_DATA_OVERRUN_STS_LEN) - 1) << ISO11898_DATA_OVERRUN_STS_POS)
#define ISO11898_DATA_OVERRUN_STS_UMSK      (~(((1U << ISO11898_DATA_OVERRUN_STS_LEN) - 1) << ISO11898_DATA_OVERRUN_STS_POS))
#define ISO11898_TRANSMIT_BUFFER_STS        ISO11898_TRANSMIT_BUFFER_STS
#define ISO11898_TRANSMIT_BUFFER_STS_POS    (2U)
#define ISO11898_TRANSMIT_BUFFER_STS_LEN    (1U)
#define ISO11898_TRANSMIT_BUFFER_STS_MSK    (((1U << ISO11898_TRANSMIT_BUFFER_STS_LEN) - 1) << ISO11898_TRANSMIT_BUFFER_STS_POS)
#define ISO11898_TRANSMIT_BUFFER_STS_UMSK   (~(((1U << ISO11898_TRANSMIT_BUFFER_STS_LEN) - 1) << ISO11898_TRANSMIT_BUFFER_STS_POS))
#define ISO11898_TRANSMIT_COMPLETE_STS      ISO11898_TRANSMIT_COMPLETE_STS
#define ISO11898_TRANSMIT_COMPLETE_STS_POS  (3U)
#define ISO11898_TRANSMIT_COMPLETE_STS_LEN  (1U)
#define ISO11898_TRANSMIT_COMPLETE_STS_MSK  (((1U << ISO11898_TRANSMIT_COMPLETE_STS_LEN) - 1) << ISO11898_TRANSMIT_COMPLETE_STS_POS)
#define ISO11898_TRANSMIT_COMPLETE_STS_UMSK (~(((1U << ISO11898_TRANSMIT_COMPLETE_STS_LEN) - 1) << ISO11898_TRANSMIT_COMPLETE_STS_POS))
#define ISO11898_RECEIVE_STS                ISO11898_RECEIVE_STS
#define ISO11898_RECEIVE_STS_POS            (4U)
#define ISO11898_RECEIVE_STS_LEN            (1U)
#define ISO11898_RECEIVE_STS_MSK            (((1U << ISO11898_RECEIVE_STS_LEN) - 1) << ISO11898_RECEIVE_STS_POS)
#define ISO11898_RECEIVE_STS_UMSK           (~(((1U << ISO11898_RECEIVE_STS_LEN) - 1) << ISO11898_RECEIVE_STS_POS))
#define ISO11898_TRANSMIT_STS               ISO11898_TRANSMIT_STS
#define ISO11898_TRANSMIT_STS_POS           (5U)
#define ISO11898_TRANSMIT_STS_LEN           (1U)
#define ISO11898_TRANSMIT_STS_MSK           (((1U << ISO11898_TRANSMIT_STS_LEN) - 1) << ISO11898_TRANSMIT_STS_POS)
#define ISO11898_TRANSMIT_STS_UMSK          (~(((1U << ISO11898_TRANSMIT_STS_LEN) - 1) << ISO11898_TRANSMIT_STS_POS))
#define ISO11898_ERROR_STS                  ISO11898_ERROR_STS
#define ISO11898_ERROR_STS_POS              (6U)
#define ISO11898_ERROR_STS_LEN              (1U)
#define ISO11898_ERROR_STS_MSK              (((1U << ISO11898_ERROR_STS_LEN) - 1) << ISO11898_ERROR_STS_POS)
#define ISO11898_ERROR_STS_UMSK             (~(((1U << ISO11898_ERROR_STS_LEN) - 1) << ISO11898_ERROR_STS_POS))
#define ISO11898_BUS_STS                    ISO11898_BUS_STS
#define ISO11898_BUS_STS_POS                (7U)
#define ISO11898_BUS_STS_LEN                (1U)
#define ISO11898_BUS_STS_MSK                (((1U << ISO11898_BUS_STS_LEN) - 1) << ISO11898_BUS_STS_POS)
#define ISO11898_BUS_STS_UMSK               (~(((1U << ISO11898_BUS_STS_LEN) - 1) << ISO11898_BUS_STS_POS))

/* 0xc : op mode:r        reset mode:r      when be read,all bits are reseted and iso11898_int disappear */
#define ISO11898_INTERRUPT_OFFSET       (0xc)
#define ISO11898_RECEIVE_INT            ISO11898_RECEIVE_INT
#define ISO11898_RECEIVE_INT_POS        (0U)
#define ISO11898_RECEIVE_INT_LEN        (1U)
#define ISO11898_RECEIVE_INT_MSK        (((1U << ISO11898_RECEIVE_INT_LEN) - 1) << ISO11898_RECEIVE_INT_POS)
#define ISO11898_RECEIVE_INT_UMSK       (~(((1U << ISO11898_RECEIVE_INT_LEN) - 1) << ISO11898_RECEIVE_INT_POS))
#define ISO11898_TRANSMIT_INT           ISO11898_TRANSMIT_INT
#define ISO11898_TRANSMIT_INT_POS       (1U)
#define ISO11898_TRANSMIT_INT_LEN       (1U)
#define ISO11898_TRANSMIT_INT_MSK       (((1U << ISO11898_TRANSMIT_INT_LEN) - 1) << ISO11898_TRANSMIT_INT_POS)
#define ISO11898_TRANSMIT_INT_UMSK      (~(((1U << ISO11898_TRANSMIT_INT_LEN) - 1) << ISO11898_TRANSMIT_INT_POS))
#define ISO11898_ERROR_INT              ISO11898_ERROR_INT
#define ISO11898_ERROR_INT_POS          (2U)
#define ISO11898_ERROR_INT_LEN          (1U)
#define ISO11898_ERROR_INT_MSK          (((1U << ISO11898_ERROR_INT_LEN) - 1) << ISO11898_ERROR_INT_POS)
#define ISO11898_ERROR_INT_UMSK         (~(((1U << ISO11898_ERROR_INT_LEN) - 1) << ISO11898_ERROR_INT_POS))
#define ISO11898_DATA_OVERRUN_INT       ISO11898_DATA_OVERRUN_INT
#define ISO11898_DATA_OVERRUN_INT_POS   (3U)
#define ISO11898_DATA_OVERRUN_INT_LEN   (1U)
#define ISO11898_DATA_OVERRUN_INT_MSK   (((1U << ISO11898_DATA_OVERRUN_INT_LEN) - 1) << ISO11898_DATA_OVERRUN_INT_POS)
#define ISO11898_DATA_OVERRUN_INT_UMSK  (~(((1U << ISO11898_DATA_OVERRUN_INT_LEN) - 1) << ISO11898_DATA_OVERRUN_INT_POS))
#define ISO11898_ERROR_PASSIVE_INT      ISO11898_ERROR_PASSIVE_INT
#define ISO11898_ERROR_PASSIVE_INT_POS  (5U)
#define ISO11898_ERROR_PASSIVE_INT_LEN  (1U)
#define ISO11898_ERROR_PASSIVE_INT_MSK  (((1U << ISO11898_ERROR_PASSIVE_INT_LEN) - 1) << ISO11898_ERROR_PASSIVE_INT_POS)
#define ISO11898_ERROR_PASSIVE_INT_UMSK (~(((1U << ISO11898_ERROR_PASSIVE_INT_LEN) - 1) << ISO11898_ERROR_PASSIVE_INT_POS))
#define ISO11898_ARB_LOST_INT           ISO11898_ARB_LOST_INT
#define ISO11898_ARB_LOST_INT_POS       (6U)
#define ISO11898_ARB_LOST_INT_LEN       (1U)
#define ISO11898_ARB_LOST_INT_MSK       (((1U << ISO11898_ARB_LOST_INT_LEN) - 1) << ISO11898_ARB_LOST_INT_POS)
#define ISO11898_ARB_LOST_INT_UMSK      (~(((1U << ISO11898_ARB_LOST_INT_LEN) - 1) << ISO11898_ARB_LOST_INT_POS))
#define ISO11898_BUS_ERROR_INT          ISO11898_BUS_ERROR_INT
#define ISO11898_BUS_ERROR_INT_POS      (7U)
#define ISO11898_BUS_ERROR_INT_LEN      (1U)
#define ISO11898_BUS_ERROR_INT_MSK      (((1U << ISO11898_BUS_ERROR_INT_LEN) - 1) << ISO11898_BUS_ERROR_INT_POS)
#define ISO11898_BUS_ERROR_INT_UMSK     (~(((1U << ISO11898_BUS_ERROR_INT_LEN) - 1) << ISO11898_BUS_ERROR_INT_POS))

