XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/iso11898_reg.h
    /* 0x20  reserved */
    uint8_t RESERVED0x20[12];

    /* 0x2c : op mode:r       reset mode:r */
    union {
        struct {
            uint32_t ALC4_0        : 5;  /* [ 4: 0],          r,        0x0 */
            uint32_t rsvd_7_5      : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } arb_lost_capture;

    /* 0x30 : op mode:r      reset mode:r */
    union {
        struct {
            uint32_t segment4_0    : 5;  /* [ 4: 0],          r,        0x0 */
            uint32_t dir           : 1;  /* [    5],          r,        0x0 */
            uint32_t err_code      : 2;  /* [ 7: 6],          r,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } error_code_capture;

    /* 0x34 : op mode:r     reset mode:rw */
    union {
        struct {
            uint32_t err_warning_limit : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } error_warning_limit;

    /* 0x38 : op mode:r     reset mode:rw */
    union {
        struct {
            uint32_t rx_err_cnt    : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rx_err_count;

    /* 0x3c : op mode:r      reset mode:rw */
    union {
        struct {
            uint32_t tx_err_cnt    : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_err_count;

    /* 0x40 : op mode: w  ->  tx_frm_info
                r   ->  rx_frm_info
reset mode:rw  -> acceptance_code0 */
    union {
        struct {
            uint32_t txrx_frm_info_or_acceptance_code0 : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31                     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } txrx_frm_info_or_acceptance_code0;

    /* 0x44 : op mode:w  ->  tx_id1
               r   ->  rx_id1
reset mode:rw  ->  acceptance_code1 */
    union {
        struct {
            uint32_t txrx_id1_or_acceptance_code1 : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31                : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } txrx_id1_or_acceptance_code1;

    /* 0x48 : op mode:w   ->  tx_id2
                r   ->  rx_id2
 reset mode:rw ->  acceptance_code2 */
    union {
        struct {
            uint32_t txrx_id2_or_acceptance_code2 : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31                : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } txrx_id2_or_acceptance_code2;

    /* 0x4c : op mode:w  ->  tx_data1_s or tx_id3
               r   ->  rx_data1_s or rx_id3
 reset mode:rw  ->  acceptance_code3 */
    union {
        struct {
            uint32_t txrx_data1_s_or_txrx_id3_e_or_acceptance_code3 : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31                                  : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } txrx_data1_s_or_txrx_id3_e_or_acceptance_code3;

    /* 0x50 : op mode:w  ->   tx_data2_s or tx_id4
               r   ->   rx_data2_s or rx_id4
reset mode:rw  ->  acceptance_mask0 */
    union {
        struct {
            uint32_t txrx_data2_s_or_txrx_id4_e_or_acceptance_mask0 : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31                                  : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } txrx_data2_s_or_txrx_id4_e_or_acceptance_mask0;

    /* 0x54 : op mode:w  ->   tx_data3_s or  tx_data1_e
               r   ->   rx_data3_s or rx_data1_e
reset mode:rw  ->  acceptance_mask1 */
    union {
        struct {
            uint32_t txrx_data3_s_or_txrx_data1_e_or_acceptance_mask1 : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31                                    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } txrx_data3_s_or_txrx_data1_e_or_acceptance_mask1;

    /* 0x58 : op mode:w  ->   tx_data4_s or  tx_data2_e
               r   ->   rx_data4_s or rx_data2_e
reset mode:rw  ->  acceptance_mask2 */
    union {
        struct {
            uint32_t txrx_data4_s_or_txrx_data2_e_or_acceptance_mask2 : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31                                    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } txrx_data4_s_or_txrx_data2_e_or_acceptance_mask2;

    /* 0x5c : op mode:w  ->   tx_data5_s or  tx_data3_e
               r   ->   rx_data5_s or rx_data3_e
reset mode:rw  ->  acceptance_mask3 */
    union {
        struct {
            uint32_t txrx_data5_s_or_txrx_data3_e_or_acceptance_mask3 : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31                                    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } txrx_data5_s_or_txrx_data3_e_or_acceptance_mask3;

    /* 0x60 : op mode:w  ->   tx_data6_s or  tx_data4_e
               r   ->   rx_data6_s or rx_data4_e
reset mode:r   ->  8'H00 */
    union {
        struct {
            uint32_t txrx_data6_s_or_txrx_data4_e : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31                : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } txrx_data6_s_or_txrx_data4_e;

